---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.Illuminance
source: html/a8af045a-79ff-9eab-b191-062105c2372e.htm
---
# Autodesk.Revit.DB.SpecTypeId.Illuminance Property

Illuminance, in discipline Electrical.

## Syntax (C#)
```csharp
public static ForgeTypeId Illuminance { get; }
```